config/gptel/scope/test/integration/bash-parser-contract-layers-spec.org
#+title: Bash-Parser Contract Property Layers — Structural Invariant Tests
#+author: Jeff Farr
#+property: header-args:emacs-lisp :tangle bash-parser-contract-layers-spec.el
#+auto_tangle: y

* Purpose

These are *contract property tests* — a companion to the scenario-based
integration tests in =bash-parser-integration-spec.el=. Where those tests
exercise specific commands end-to-end, these tests derive cases /from the
contract itself/ and verify structural invariants that must hold across all
operations.

** Why Property Tests Exist Alongside Scenario Tests

Scenario tests are hand-picked examples: "cat should be allowed", "rm should be
denied". They catch specific regressions but miss systematic gaps. When the
bash-parser adds a new operation type (like =:read-directory=), no scenario test
will fail — the gap is invisible until a user hits it.

Property tests close this gap by:

1. *Deriving test cases from the contract* — if the contract says 11 operations
   exist, all 11 are tested automatically
2. *Verifying structural invariants* — "every operation is classified",
   "permissive config allows everything", "restrictive config denies everything"
3. *Catching drift automatically* — when a new operation is added, existing
   property tests fail immediately without anyone writing a new test case

** The 6 Layers

#+begin_example
Layer 1: Source-of-Truth Symmetry
        "Do contract and parser agree on the set of valid operations?"

Layer 2: Semantic Classification
        "Is every operation classified into a category with a scope mapping?"

Layer 3: Permissive Config Property
        "Does a wide-open config allow every operation?"

Layer 4: Restrictive Config Property
        "Does an empty config deny every operation?"

Layer 5: Real Command Corpus
        "Does each operation type round-trip through the real parser?"

Layer 6: Error Shape Contract
        "Do denial errors have the correct plist structure?"
#+end_example

** Relationship to Other Test Layers

#+begin_example
Layer A: Contract unit tests (config/test/contracts/test/)
         "Do the validators themselves work correctly?"
              │
Layer B: Self-validating mocks (helpers-spec.el)
         "Do our mocks match the contract?"
              │
Layer C: Scenario integration tests (bash-parser-integration-spec.el)
         "Does real data flow correctly for specific commands?"
              │
Layer D: Contract property tests (THIS FILE)
         "Do structural invariants hold across ALL operations?"
#+end_example

Layers C and D are complementary. C tests depth (full pipeline per command),
D tests breadth (every operation against every invariant).

* Setup and Dependencies

Same preamble as the companion file — explicit path resolution, no =load-path=
assumptions.

#+begin_src emacs-lisp
;;; bash-parser-contract-layers-spec.el --- Structural invariant tests for bash-parser → scope contract -*- lexical-binding: t; -*-

;; Copyright (C) 2026 Jeff Farr

;; Author: Jeff Farr
;; Keywords: tests

;;; Commentary:

;; Contract property tests: 6 layers of structural invariants that guard the
;; bash-parser → scope validation boundary.  These tests derive cases from the
;; contract itself rather than manually enumerating scenarios.
;;
;; Layer 1: Source-of-truth symmetry (parser ↔ contract agreement)
;; Layer 2: Semantic classification (every operation has a scope mapping)
;; Layer 3: Permissive config (wide-open allows everything)
;; Layer 4: Restrictive config (empty denies everything)
;; Layer 5: Real command corpus (parser round-trip per operation type)
;; Layer 6: Error shape contract (denial plists have correct structure)
;;
;; Companion to bash-parser-integration-spec.el (scenario tests).

;;; Code:

(require 'buttercup)
(require 'cl-lib)

;; Load dependencies via path resolution
(let* ((test-dir (file-name-directory (or load-file-name buffer-file-name)))
       ;; test/integration/ -> test/ -> scope/ -> gptel/ -> config/
       (scope-test-dir (expand-file-name ".." test-dir))
       (scope-dir (expand-file-name ".." scope-test-dir))
       (gptel-dir (expand-file-name ".." scope-dir))
       (config-dir (expand-file-name ".." gptel-dir))
       (contracts-dir (expand-file-name "test/contracts/" config-dir)))
  ;; Contract infrastructure
  (add-to-list 'load-path contracts-dir)
  (require 'contract-core)
  (require 'contract-bash-parser)
  (contract--register-buttercup-matcher)
  ;; Scope validation (pulls in bash-parser-core, bash-parser-orchestrator)
  (require 'jf-gptel-scope-shell-tools
           (expand-file-name "scope/scope-shell-tools.el" gptel-dir))
  ;; Helpers for scope config builders
  (require 'helpers-spec (expand-file-name "helpers-spec.el" scope-test-dir)))
#+end_src

* Data Structures

Three =defconst= forms that encode the semantic relationship between parser
operations and scope validation.

** Operation Classification Map

Maps each of the 11 contract-defined operations to a semantic category.
Categories determine which scope config keys grant permission.

#+begin_src emacs-lisp
;;; Data Structures

(defconst contract-layers-spec--operation-classification
  '(;; Read-like: check read or write patterns
    (:read           . :read-like)
    (:read-directory . :read-like)
    (:read-metadata  . :read-like)
    (:match-pattern  . :read-like)
    ;; Write-like: check write patterns
    (:write          . :write-like)
    (:create         . :write-like)
    (:create-or-modify . :write-like)
    (:append         . :write-like)
    (:delete         . :write-like)
    ;; Modify-like: check modify or write patterns
    (:modify         . :modify-like)
    ;; Execute-like: check execute patterns
    (:execute        . :execute-like))
  "Maps each contract operation to its semantic category.
Categories determine which scope config keys allow the operation.")
#+end_src

** Category-to-Scope-Keys Map

Documents which scope config keys each category checks. Used by Layer 2 to build
per-category scope configs.

#+begin_src emacs-lisp
(defconst contract-layers-spec--category-scope-keys
  '((:read-like    . (:read :write))      ; read OR write grants read access
    (:write-like   . (:write))             ; only write grants write access
    (:modify-like  . (:modify :write))     ; modify OR write grants modify access
    (:execute-like . (:execute)))          ; only execute grants execute access
  "Maps each semantic category to the scope config keys that allow it.
When multiple keys listed, any one is sufficient (OR semantics).")
#+end_src

** Command Corpus

One representative command per operation type. Used by Layer 5 to verify parser
round-trip. Each entry maps an operation keyword to a command string and
expected extraction details.

#+begin_src emacs-lisp
(defconst contract-layers-spec--command-corpus
  '((:read           "cat /tmp/file.txt"           "cat")
    (:read-directory  "ls /tmp"                     "ls")
    (:read-metadata   "which python3"               "which")
    (:match-pattern   "find /tmp -name '*.txt'"     "find")
    (:write           "echo hello > /tmp/out.txt"   "echo")
    (:create          "mkdir /tmp/newdir"            "mkdir")
    (:create-or-modify "touch /tmp/file.txt"        "touch")
    (:append          "echo data >> /tmp/log.txt"   "echo")
    (:delete          "rm /tmp/file.txt"             "rm")
    (:modify          "chmod 755 /tmp/script.sh"    "chmod")
    (:execute         "bash /tmp/script.sh"         "bash"))
  "One representative command per operation type.
Format: (OPERATION COMMAND-STRING EXPECTED-COMMAND-NAME).
Used by Layer 5 for parser round-trip verification.")
#+end_src

* Fixture Builders

Scope configs for the two extremes: permissive (everything allowed) and
restrictive (nothing allowed). Built using the same helpers as the scenario
tests.

#+begin_src emacs-lisp
;;; Fixture Builders

(defun contract-layers-spec--permissive-config ()
  "Build scope config that allows all path patterns.
Every operation type should be allowed for any path."
  (let ((scope-yml (helpers-spec-make-scope-yml
                    (helpers-spec--scope-with-paths
                     '("/**") '("/**") '("/**") '("/**") nil))))
    (unwind-protect
        (helpers-spec-load-scope-config scope-yml)
      (delete-file scope-yml))))

(defun contract-layers-spec--restrictive-config ()
  "Build scope config with empty path patterns.
Every operation type should be denied for any path."
  (let ((scope-yml (helpers-spec-make-scope-yml
                    (helpers-spec--scope-with-paths
                     nil nil nil nil nil))))
    (unwind-protect
        (helpers-spec-load-scope-config scope-yml)
      (delete-file scope-yml))))
#+end_src

* Test Layers

All 6 layers in a single =describe= block sharing the fixture configs.

#+begin_src emacs-lisp
;;; Test Layers

(describe "Contract property layers (structural invariants)"

  (let (permissive-config restrictive-config)

    (before-all
      (setq permissive-config (contract-layers-spec--permissive-config))
      (setq restrictive-config (contract-layers-spec--restrictive-config)))
#+end_src

** Layer 1: Source-of-Truth Symmetry Guard

Verifies that the contract's =contract/bash--valid-operations= and the parser's
=jf/bash-valid-operation-types= contain exactly the same operations. If the
parser adds a new operation type, this test fails immediately.

#+begin_src emacs-lisp
    ;; -- Layer 1: Source-of-Truth Symmetry Guard --
    (describe "Layer 1: source-of-truth symmetry"
      (it "contract/bash--valid-operations equals jf/bash-valid-operation-types"
        (let ((contract-ops (sort (copy-sequence contract/bash--valid-operations)
                                  #'string< ))
              (parser-ops (sort (copy-sequence jf/bash-valid-operation-types)
                                #'string< )))
          (expect contract-ops :to-equal parser-ops))))
#+end_src

