config/gptel/scope/test/integration/bash-parser-contract-layers-spec.el
;;; bash-parser-contract-layers-spec.el --- Structural invariant tests for bash-parser → scope contract -*- lexical-binding: t; -*-

;; Copyright (C) 2026 Jeff Farr

;; Author: Jeff Farr
;; Keywords: tests

;;; Commentary:

;; Contract property tests: 6 layers of structural invariants that guard the
;; bash-parser → scope validation boundary.  These tests derive cases from the
;; contract itself rather than manually enumerating scenarios.
;;
;; Layer 1: Source-of-truth symmetry (parser ↔ contract agreement)
;; Layer 2: Semantic classification (every operation has a scope mapping)
;; Layer 3: Permissive config (wide-open allows everything)
;; Layer 4: Restrictive config (empty denies everything)
;; Layer 5: Real command corpus (parser round-trip per operation type)
;; Layer 6: Error shape contract (denial plists have correct structure)
;;
;; Companion to bash-parser-integration-spec.el (scenario tests).

;;; Code:

(require 'buttercup)
(require 'cl-lib)

;; Load dependencies via path resolution
(let* ((test-dir (file-name-directory (or load-file-name buffer-file-name)))
       ;; test/integration/ -> test/ -> scope/ -> gptel/ -> config/
       (scope-test-dir (expand-file-name ".." test-dir))
       (scope-dir (expand-file-name ".." scope-test-dir))
       (gptel-dir (expand-file-name ".." scope-dir))
       (config-dir (expand-file-name ".." gptel-dir))
       (contracts-dir (expand-file-name "test/contracts/" config-dir)))
  ;; Contract infrastructure
  (add-to-list 'load-path contracts-dir)
  (require 'contract-core)
  (require 'contract-bash-parser)
  (contract--register-buttercup-matcher)
  ;; Scope validation (pulls in bash-parser-core, bash-parser-orchestrator)
  (require 'jf-gptel-scope-shell-tools
           (expand-file-name "scope/scope-shell-tools.el" gptel-dir))
  ;; Helpers for scope config builders
  (require 'helpers-spec (expand-file-name "helpers-spec.el" scope-test-dir)))

;;; Data Structures

(defconst contract-layers-spec--operation-classification
  '(;; Read-like: check read or write patterns
    (:read           . :read-like)
    (:read-directory . :read-like)
    (:read-metadata  . :read-like)
    (:match-pattern  . :read-like)
    ;; Write-like: check write patterns
    (:write          . :write-like)
    (:create         . :write-like)
    (:create-or-modify . :write-like)
    (:append         . :write-like)
    (:delete         . :write-like)
    ;; Modify-like: check modify or write patterns
    (:modify         . :modify-like)
    ;; Execute-like: check execute patterns
    (:execute        . :execute-like))
  "Maps each contract operation to its semantic category.
Categories determine which scope config keys allow the operation.")

(defconst contract-layers-spec--category-scope-keys
  '((:read-like    . (:read :write))      ; read OR write grants read access
    (:write-like   . (:write))             ; only write grants write access
    (:modify-like  . (:modify :write))     ; modify OR write grants modify access
    (:execute-like . (:execute)))          ; only execute grants execute access
  "Maps each semantic category to the scope config keys that allow it.
When multiple keys listed, any one is sufficient (OR semantics).")

(defconst contract-layers-spec--command-corpus
  '((:read           "cat /tmp/file.txt"           "cat")
    (:read-directory  "ls /tmp"                     "ls")
    (:read-metadata   "which python3"               "which")
    (:match-pattern   "find /tmp -name '*.txt'"     "find")
    (:write           "echo hello > /tmp/out.txt"   "echo")
    (:create          "mkdir /tmp/newdir"            "mkdir")
    (:create-or-modify "touch /tmp/file.txt"        "touch")
    (:append          "echo data >> /tmp/log.txt"   "echo")
    (:delete          "rm /tmp/file.txt"             "rm")
    (:modify          "chmod 755 /tmp/script.sh"    "chmod")
    (:execute         "bash /tmp/script.sh"         "bash"))
  "One representative command per operation type.
Format: (OPERATION COMMAND-STRING EXPECTED-COMMAND-NAME).
Used by Layer 5 for parser round-trip verification.")

;;; Fixture Builders

(defun contract-layers-spec--permissive-config ()
  "Build scope config that allows all path patterns.
Every operation type should be allowed for any path."
  (let ((scope-yml (helpers-spec-make-scope-yml
                    (helpers-spec--scope-with-paths
                     '("/**") '("/**") '("/**") '("/**") nil))))
    (unwind-protect
        (helpers-spec-load-scope-config scope-yml)
      (delete-file scope-yml))))

(defun contract-layers-spec--restrictive-config ()
  "Build scope config with empty path patterns.
Every operation type should be denied for any path."
  (let ((scope-yml (helpers-spec-make-scope-yml
                    (helpers-spec--scope-with-paths
                     nil nil nil nil nil))))
    (unwind-protect
        (helpers-spec-load-scope-config scope-yml)
      (delete-file scope-yml))))

;;; Test Layers

(describe "Contract property layers (structural invariants)"

  (let (permissive-config restrictive-config)

    (before-all
      (setq permissive-config (contract-layers-spec--permissive-config))
      (setq restrictive-config (contract-layers-spec--restrictive-config)))

;; -- Layer 1: Source-of-Truth Symmetry Guard --
(describe "Layer 1: source-of-truth symmetry"
  (it "contract/bash--valid-operations equals jf/bash-valid-operation-types"
    (let ((contract-ops (sort (copy-sequence contract/bash--valid-operations)
                              #'string< ))
          (parser-ops (sort (copy-sequence jf/bash-valid-operation-types)
                            #'string< )))
      (expect contract-ops :to-equal parser-ops))))
