config/gptel/scope/test/integration/bash-parser-contract-layers-spec.el

;; -- Layer 2: Semantic Classification Contract --
(describe "Layer 2: semantic classification"

  (it "every contract operation appears in the classification map"
    (let ((classified-ops (mapcar #'car contract-layers-spec--operation-classification)))
      (dolist (op contract/bash--valid-operations)
        (expect (memq op classified-ops) :to-be-truthy))))

  (it ":read-like operations are allowed with read patterns"
    (let* ((read-yml (helpers-spec-make-scope-yml
                      (helpers-spec--scope-with-paths
                       '("/**") nil nil nil nil)))
           (read-config (unwind-protect
                            (helpers-spec-load-scope-config read-yml)
                          (delete-file read-yml)))
           (paths-config (plist-get read-config :paths))
           (read-like-ops (mapcar #'car
                                  (cl-remove-if-not
                                   (lambda (entry) (eq (cdr entry) :read-like))
                                   contract-layers-spec--operation-classification))))
      (dolist (op read-like-ops)
        (expect (jf/gptel-scope--validate-operation op "/tmp/file.txt" paths-config)
                :to-be nil))))

  (it ":write-like operations are allowed with write patterns"
    (let* ((write-yml (helpers-spec-make-scope-yml
                       (helpers-spec--scope-with-paths
                        nil '("/**") nil nil nil)))
           (write-config (unwind-protect
                             (helpers-spec-load-scope-config write-yml)
                           (delete-file write-yml)))
           (paths-config (plist-get write-config :paths))
           (write-like-ops (mapcar #'car
                                   (cl-remove-if-not
                                    (lambda (entry) (eq (cdr entry) :write-like))
                                    contract-layers-spec--operation-classification))))
      (dolist (op write-like-ops)
        (expect (jf/gptel-scope--validate-operation op "/tmp/file.txt" paths-config)
                :to-be nil))))

  (it ":modify-like operations are allowed with modify patterns"
    (let* ((modify-yml (helpers-spec-make-scope-yml
                        (helpers-spec--scope-with-paths
                         nil nil nil '("/**") nil)))
           (modify-config (unwind-protect
                              (helpers-spec-load-scope-config modify-yml)
                            (delete-file modify-yml)))
           (paths-config (plist-get modify-config :paths))
           (modify-like-ops (mapcar #'car
                                    (cl-remove-if-not
                                     (lambda (entry) (eq (cdr entry) :modify-like))
                                     contract-layers-spec--operation-classification))))
      (dolist (op modify-like-ops)
        (expect (jf/gptel-scope--validate-operation op "/tmp/file.txt" paths-config)
                :to-be nil))))

  (it ":execute-like operations are allowed with execute patterns"
    (let* ((exec-yml (helpers-spec-make-scope-yml
                      (helpers-spec--scope-with-paths
                       nil nil '("/**") nil nil)))
           (exec-config (unwind-protect
                            (helpers-spec-load-scope-config exec-yml)
                          (delete-file exec-yml)))
           (paths-config (plist-get exec-config :paths))
           (exec-like-ops (mapcar #'car
                                  (cl-remove-if-not
                                   (lambda (entry) (eq (cdr entry) :execute-like))
                                   contract-layers-spec--operation-classification))))
      (dolist (op exec-like-ops)
        (expect (jf/gptel-scope--validate-operation op "/tmp/file.txt" paths-config)
                :to-be nil)))))

;; -- Layer 3: Permissive Config Property --
(describe "Layer 3: permissive config allows everything"
  (it "every contract operation is allowed with all-permissive paths"
    (let ((paths-config (plist-get permissive-config :paths))
          (failures nil))
      (dolist (op contract/bash--valid-operations)
        (let ((result (jf/gptel-scope--validate-operation
                       op "/tmp/file.txt" paths-config)))
          (when result
            (push (format "%s -> %S" op result) failures))))
      (expect failures :to-equal nil))))

;; -- Layer 4: Restrictive Config Property --
(describe "Layer 4: restrictive config denies everything"
  (it "every contract operation is denied with empty paths"
    (let ((paths-config (plist-get restrictive-config :paths))
          (passes nil))
      (dolist (op contract/bash--valid-operations)
        (let ((result (jf/gptel-scope--validate-operation
                       op "/tmp/file.txt" paths-config)))
          (when (null result)
            (push op passes))))
      (expect passes :to-equal nil))))

;; -- Layer 5: Real Command Corpus --
(describe "Layer 5: real command corpus round-trip"
  (dolist (entry contract-layers-spec--command-corpus)
    (let ((expected-op (nth 0 entry))
          (command (nth 1 entry))
          (expected-cmd-name (nth 2 entry)))
      (it (format "parses %S and extracts :%s operation"
                  command (substring (symbol-name expected-op) 1))
        (let* ((parsed (jf/bash-parse command))
               (semantics (jf/bash-extract-semantics parsed))
               (file-ops (alist-get :filesystem (plist-get semantics :domains))))
          ;; Parser should produce valid output
          (expect parsed :to-satisfy-contract #'contract/bash-parse-result--validate)
          (expect semantics :to-satisfy-contract #'contract/bash-semantics--validate)
          ;; Expected operation should appear in file-ops
          ;; (may be nil for commands whose file-ops depend on redirect extraction)
          (if file-ops
              (expect (cl-some (lambda (op)
                                 (eq (plist-get op :operation) expected-op))
                               file-ops)
                      :to-be-truthy)
            ;; No file-ops extracted — informative pending
            (expect file-ops :not :to-be nil)))))))

;; -- Layer 6: Error Shape Contract --
