config/gptel/scope/test/integration/bash-parser-contract-layers-spec.el
(describe "Layer 6: error shape contract"
  (it "every denied operation produces correctly shaped error plist"
    (let ((paths-config (plist-get restrictive-config :paths))
          (test-path "/tmp/file.txt")
          (shape-errors nil))
      (dolist (op contract/bash--valid-operations)
        (let ((result (jf/gptel-scope--validate-operation
                       op test-path paths-config)))
          (cond
           ;; Unexpectedly allowed — not a shape error, Layer 4 catches this
           ((null result) nil)
           ;; Check error plist shape
           (t
            (unless (stringp (plist-get result :error))
              (push (format "%s: :error not a string, got %S"
                            op (plist-get result :error))
                    shape-errors))
            (unless (and (stringp (plist-get result :path))
                         (string= (plist-get result :path) test-path))
              (push (format "%s: :path mismatch, expected %S got %S"
                            op test-path (plist-get result :path))
                    shape-errors))
            (unless (eq (plist-get result :operation) op)
              (push (format "%s: :operation mismatch, expected %S got %S"
                            op op (plist-get result :operation))
                    shape-errors))
            (unless (stringp (plist-get result :message))
              (push (format "%s: :message not a string, got %S"
                            op (plist-get result :message))
                    shape-errors))))))
      (expect shape-errors :to-equal nil))))))

(provide 'bash-parser-contract-layers-spec)

;;; bash-parser-contract-layers-spec.el ends here
